name: "cityscapes"
platform: "onnxruntime_onnx"
default_model_filename: "model.onnx"
max_batch_size: 0

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_INT64
    # Ustawiamy 4 wymiary, ale używamy -1, żeby pasowało do dynamicznego wyjścia modelu.
    # To naprawi błąd "expects 4 dimensions".
    dims: [ 1, -1, -1, -1 ]
  }
]

instance_group [
  { kind: KIND_CPU count: 1 }
]